gdgly/stm32L151_nbiot_tmote_app_workspace/hc32L196_nbiot_tmote_app_spot/User/platform_map.c
	/* 获取调试信息输出等级 */
	TCFG_SystemData.RFDPrintfLevel = TCFG_EEPROM_Get_RFDPrintfLevel();
	if ((TCFG_SystemData.RFDPrintfLevel < RF_DPRINT_LEVEL_0) || (TCFG_SystemData.RFDPrintfLevel > RF_DPRINT_LEVEL_3)) {
		TCFG_SystemData.RFDPrintfLevel = RADIO_RF_DPRINTFL;
		TCFG_EEPROM_Set_RFDPrintfLevel(TCFG_SystemData.RFDPrintfLevel);
	}
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_SystemConfigInfo_Restore(void)
 @Description			TCFG_EEPROM_SystemConfigInfo_Restore			: 恢复出厂配置信息
 @Input				void
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_SystemConfigInfo_Restore(void)
{
	TCFG_EEPROM_WriteSystemConfigData();
	TCFG_EEPROM_WriteSystemParamtData();
}








































/********************** Check if the SN & Vender and the Backup space are the same ***********************/
/**********************************************************************************************************
 @Function			bool  TCFG_EEPROM_CheckNewSerialInfomation(void)
 @Description			TCFG_EEPROM_CheckNewSerialInfomation			: 检测新的设备厂牌信息
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool  TCFG_EEPROM_CheckNewSerialInfomation(void)
{
	if ((TCFG_EEPROM_Get_Backup_MAC_SN() == 0) && (TCFG_EEPROM_Get_Backup_Vender() == 0)) {
		return true;
	}
	
	if ((TCFG_EEPROM_Get_Backup_MAC_SN() != TCFG_EEPROM_Get_Source_MAC_SN()) || (TCFG_EEPROM_Get_Backup_Vender() != TCFG_EEPROM_Get_Source_Vender())) {
		return true;
	}
	
	return false;
}

u32   TCFG_EEPROM_Get_Source_MAC_SN(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
}

u32   TCFG_EEPROM_Get_Source_Vender(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORY_VENDER_OFFSET);
}

void  TCFG_EEPROM_Set_Backup_MAC_SN(u32 val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORYBACKUP_MAC_SN_OFFSET, val);
}

u32   TCFG_EEPROM_Get_Backup_MAC_SN(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORYBACKUP_MAC_SN_OFFSET);
}

void  TCFG_EEPROM_Set_Backup_Vender(u32 val)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORYBACKUP_VENDER_OFFSET, val);
}

u32   TCFG_EEPROM_Get_Backup_Vender(void)
{
	return FLASH_EEPROM_ReadWord(TCFG_FACTORYBACKUP_VENDER_OFFSET);
}
/*********************************************************************************************************/

/********************** Check if the SoftwareVer and the Backup space are the same ***********************/
/**********************************************************************************************************
 @Function			bool  TCFG_EEPROM_CheckNewSoftwareEditions(void)
 @Description			TCFG_EEPROM_CheckNewSoftwareEditions			: 检测新的固件版本信息
 @Input				void
 @Return				bool
**********************************************************************************************************/
bool  TCFG_EEPROM_CheckNewSoftwareEditions(void)
{
	if ((TCFG_EEPROM_Get_Backup_SoftwareMajor() == 0) && (TCFG_EEPROM_Get_Backup_SoftwareMinor() == 0)) {
		return true;
	}
	
	if ((TCFG_EEPROM_Get_Backup_SoftwareMajor() != TCFG_EEPROM_Get_Source_SoftwareMajor()) || (TCFG_EEPROM_Get_Backup_SoftwareMinor() != TCFG_EEPROM_Get_Source_SoftwareMinor())) {
		return true;
	}
	
	return false;
}

u8    TCFG_EEPROM_Get_Source_SoftwareMajor(void)
{
	return TCFG_Utility_Get_Major_SoftwareNumber();
}

u8    TCFG_EEPROM_Get_Source_SoftwareMinor(void)
{
	return TCFG_Utility_Get_Minor_SoftwareNumber();
}

void  TCFG_EEPROM_Set_Backup_SoftwareMajor(u8 val)
{
	FLASH_EEPROM_WriteByte(TCFG_SOFTWAREBACKUP_MAJOR_OFFSET, val);
}

u8    TCFG_EEPROM_Get_Backup_SoftwareMajor(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_SOFTWAREBACKUP_MAJOR_OFFSET);
}

void  TCFG_EEPROM_Set_Backup_SoftwareMinor(u8 val)
{
	FLASH_EEPROM_WriteByte(TCFG_SOFTWAREBACKUP_MINOR_OFFSET, val);
}

u8    TCFG_EEPROM_Get_Backup_SoftwareMinor(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_SOFTWAREBACKUP_MINOR_OFFSET);
}
/*********************************************************************************************************/

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_MAC_SN(u32 sn)
 @Description			TCFG_EEPROM_Set_MAC_SN						: 保存MAC_SN
 @Input				sn
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_MAC_SN(u32 sn)
{
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_MAC_SN_OFFSET, sn);
}

/**********************************************************************************************************
 @Function			u32   TCFG_EEPROM_Get_MAC_SN(void)
 @Description			TCFG_EEPROM_Get_MAC_SN						: 读取MAC_SN
 @Input				void
 @Return				sn
**********************************************************************************************************/
u32   TCFG_EEPROM_Get_MAC_SN(void)
{
	u32 sn = 0;
	
	sn = FLASH_EEPROM_ReadWord(TCFG_FACTORY_MAC_SN_OFFSET);
	
	sn = (sn == 0) ? 1 : sn;
	
	return sn;
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_MAC_SN_String(void)
 @Description			TCFG_EEPROM_Get_MAC_SN_String					: 读取MAC SN字符串
 @Input				void
 @Return				sn_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_MAC_SN_String(void)
{
	memset((void *)TCFG_SystemData.FactoryMacsn, 0x00, sizeof(TCFG_SystemData.FactoryMacsn));
	
	sprintf((char *)TCFG_SystemData.FactoryMacsn, "%08x", TCFG_EEPROM_Get_MAC_SN());
	
	return (char *)TCFG_SystemData.FactoryMacsn;
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_Vender(char* vender)
 @Description			TCFG_EEPROM_Set_Vender						: 保存Vender
 @Input				vender
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_Vender(char* vender)
{
	vender[TCFG_FACTORY_VENDER_LENGTH - 1] = '\0';
	FLASH_EEPROM_WriteBuffer(TCFG_FACTORY_VENDER_OFFSET, (u8*)vender, TCFG_FACTORY_VENDER_LENGTH);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_Vender(char* vender)
 @Description			TCFG_EEPROM_Set_Vender						: 读取Vender
 @Input				vender
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Get_Vender(char* vender)
{
	FLASH_EEPROM_ReadBuffer(TCFG_FACTORY_VENDER_OFFSET, (u8*)vender, TCFG_FACTORY_VENDER_LENGTH);
	vender[TCFG_FACTORY_VENDER_LENGTH - 1] = '\0';
}

/**********************************************************************************************************
 @Function			char* TCFG_EEPROM_Get_Vender_String(void)
 @Description			TCFG_EEPROM_Get_Vender_String					: 读取vender字符串
 @Input				void
 @Return				vender_string
**********************************************************************************************************/
char* TCFG_EEPROM_Get_Vender_String(void)
{
	memset((void *)TCFG_SystemData.FactoryVender, 0x00, sizeof(TCFG_SystemData.FactoryVender));
	
	TCFG_EEPROM_Get_Vender((char *)TCFG_SystemData.FactoryVender);
	
	return (char *)TCFG_SystemData.FactoryVender;
}




























/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_BootVersion(u8 bootVer)
 @Description			TCFG_EEPROM_Set_BootVersion					: 保存BootVersion
 @Input				bootVer
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_BootVersion(u8 bootVer)
{
	FLASH_EEPROM_WriteByte(TCFG_BOOT_VERSION_OFFSET, bootVer);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_BootVersion(void)
 @Description			TCFG_EEPROM_Get_BootVersion					: 读取BootVersion
 @Input				void
 @Return				bootVer
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_BootVersion(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_BOOT_VERSION_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_BootMode(u8 bootMode)
 @Description			TCFG_EEPROM_Set_BootMode						: 保存BootMode
 @Input				bootMode
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_BootMode(u8 bootMode)
{
	FLASH_EEPROM_WriteByte(TCFG_BOOT_RUNMODE_OFFSET, bootMode);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_BootMode(void)
 @Description			TCFG_EEPROM_Get_BootMode						: 读取BootMode
 @Input				void
 @Return				bootMode
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_BootMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_BOOT_RUNMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_BootCount(u8 bootCount)
 @Description			TCFG_EEPROM_Set_BootCount					: 保存BootCount
 @Input				bootCount
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_BootCount(u8 bootCount)
{
	FLASH_EEPROM_WriteByte(TCFG_BOOT_RECOUNT_OFFSET, bootCount);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_BootCount(void)
 @Description			TCFG_EEPROM_Get_BootCount					: 读取BootCount
 @Input				void
 @Return				bootCount
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_BootCount(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_BOOT_RECOUNT_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_RadioChannel(u8 channel)
 @Description			TCFG_EEPROM_Set_RadioChannel					: 保存RadioChannel
 @Input				channel
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_RadioChannel(u8 channel)
{
	FLASH_EEPROM_WriteByte(TCFG_RADIO_CHANNEL_OFFSET, channel);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_RadioChannel(void)
 @Description			TCFG_EEPROM_Get_RadioChannel					: 读取RadioChannel
 @Input				void
 @Return				channel
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_RadioChannel(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADIO_CHANNEL_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_RadioHeartval(u8 heartval)
 @Description			TCFG_EEPROM_Set_RadioHeartval					: 保存RadioHeartval
 @Input				heartval
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_RadioHeartval(u8 heartval)
{
	FLASH_EEPROM_WriteByte(TCFG_RADIO_HEARTVL_OFFSET, heartval);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_RadioHeartval(void)
 @Description			TCFG_EEPROM_Get_RadioHeartval					: 读取RadioHeartval
 @Input				void
 @Return				heartval
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_RadioHeartval(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RADIO_HEARTVL_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_DeviceRebootMode(u8 rebootmode)
 @Description			TCFG_EEPROM_Set_DeviceRebootMode				: 保存DeviceRebootMode
 @Input				rebootmode
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_DeviceRebootMode(u8 rebootmode)
{
	FLASH_EEPROM_WriteByte(TCFG_DEVICE_RBTMODE_OFFSET, rebootmode);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_DeviceRebootMode(void)
 @Description			TCFG_EEPROM_Get_DeviceRebootMode				: 读取DeviceRebootMode
 @Input				void
 @Return				rebootmode
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_DeviceRebootMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_DEVICE_RBTMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_Sensitivity(u8 sens)
 @Description			TCFG_EEPROM_Set_Sensitivity					: 保存Sensitivity
 @Input				sens
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_Sensitivity(u8 sens)
{
	FLASH_EEPROM_WriteByte(TCFG_SENSITIVITY_OFFSET, sens);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_Sensitivity(void)
 @Description			TCFG_EEPROM_Get_Sensitivity					: 读取Sensitivity
 @Input				void
 @Return				sens
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_Sensitivity(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_SENSITIVITY_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_WorkMode(u8 workmode)
 @Description			TCFG_EEPROM_Set_WorkMode						: 保存WorkMode
 @Input				workmode
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_WorkMode(u8 workmode)
{
	FLASH_EEPROM_WriteByte(TCFG_WORKMODE_OFFSET, workmode);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_WorkMode(void)
 @Description			TCFG_EEPROM_Get_WorkMode						: 读取WorkMode
 @Input				void
 @Return				workmode
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_WorkMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_WORKMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_IdleMode(u8 idlemode)
 @Description			TCFG_EEPROM_Set_IdleMode						: 保存IdleMode
 @Input				idlemode
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_IdleMode(u8 idlemode)
{
	FLASH_EEPROM_WriteByte(TCFG_IDLEMODE_OFFSET, idlemode);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_IdleMode(void)
 @Description			TCFG_EEPROM_Get_IdleMode						: 读取IdleMode
 @Input				void
 @Return				idlemode
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_IdleMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_IDLEMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_ActiveMode(u8 active)
 @Description			TCFG_EEPROM_Set_ActiveMode					: 保存ActiveMode
 @Input				active
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_ActiveMode(u8 active)
{
	FLASH_EEPROM_WriteByte(TCFG_ACTIVEMODE_OFFSET, active);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_ActiveMode(void)
 @Description			TCFG_EEPROM_Get_ActiveMode					: 读取ActiveMode
 @Input				void
 @Return				active
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_ActiveMode(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_ACTIVEMODE_OFFSET);
}

/**********************************************************************************************************
 @Function			void  TCFG_EEPROM_Set_RFDPrintfLevel(u8 active)
 @Description			TCFG_EEPROM_Set_RFDPrintfLevel				: 保存RFDPrintfLevel
 @Input				level
 @Return				void
**********************************************************************************************************/
void  TCFG_EEPROM_Set_RFDPrintfLevel(u8 level)
{
	FLASH_EEPROM_WriteByte(TCFG_RF_DPRINT_LEVEL_OFFSET, level);
}

/**********************************************************************************************************
 @Function			u8    TCFG_EEPROM_Get_RFDPrintfLevel(void)
 @Description			TCFG_EEPROM_Get_RFDPrintfLevel				: 读取RFDPrintfLevel
 @Input				void
 @Return				level
**********************************************************************************************************/
u8    TCFG_EEPROM_Get_RFDPrintfLevel(void)
{
	return FLASH_EEPROM_ReadByte(TCFG_RF_DPRINT_LEVEL_OFFSET);
}

















































/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_Factory_MacSN(u32 sn)
 @Description			TCFG_Utility_Set_Factory_MacSN				: 设置Factory MacSN
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_Factory_MacSN(u32 sn)
{
	TCFG_SystemData.MacSN = sn;
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_MAC_SN_OFFSET, TCFG_SystemData.MacSN);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_Factory_Vender(u32 vender)
 @Description			TCFG_Utility_Set_Factory_Vender				: 设置Factory Vender
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_Factory_Vender(u32 vender)
{
	TCFG_SystemData.Vender = vender;
	FLASH_EEPROM_WriteWord(TCFG_FACTORY_VENDER_OFFSET, TCFG_SystemData.Vender);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_BootVersion(u8 bootVer)
 @Description			TCFG_Utility_Set_BootVersion					: 设置BootVersion
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_BootVersion(u8 bootVer)
{
	TCFG_SystemData.BootVersion = bootVer;
	TCFG_EEPROM_Set_BootVersion(TCFG_SystemData.BootVersion);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_BootMode(u8 bootMode)
 @Description			TCFG_Utility_Set_BootMode					: 设置BootMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_BootMode(u8 bootMode)
{
	TCFG_SystemData.BootRunmode = bootMode;
	TCFG_EEPROM_Set_BootMode(TCFG_SystemData.BootRunmode);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_BootCount(u8 bootCount)
 @Description			TCFG_Utility_Set_BootCount					: 设置BootCount
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_BootCount(u8 bootCount)
{
	TCFG_SystemData.BootRecount = bootCount;
	TCFG_EEPROM_Set_BootCount(TCFG_SystemData.BootRecount);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_RadioChannel(u8 channel)
 @Description			TCFG_Utility_Set_RadioChannel					: 设置RadioChannel
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_RadioChannel(u8 channel)
{
	TCFG_SystemData.RadioChannel = channel;
	if ((TCFG_SystemData.RadioChannel != 36) && (TCFG_SystemData.RadioChannel != 4) && (TCFG_SystemData.RadioChannel != 6) && (TCFG_SystemData.RadioChannel != 16) && (TCFG_SystemData.RadioChannel != 26)) {
		TCFG_SystemData.RadioChannel = RADIO_RF_CHANNEL1;
	}
	TCFG_EEPROM_Set_RadioChannel(TCFG_SystemData.RadioChannel);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_RadioHeartval(u8 heartval)
 @Description			TCFG_Utility_Set_RadioHeartval				: 设置RadioHeartval
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_RadioHeartval(u8 heartval)
{
	TCFG_SystemData.RadioHeartval = heartval;
	if ((TCFG_SystemData.RadioHeartval < 1) || (TCFG_SystemData.RadioHeartval > 120)) {
		TCFG_SystemData.RadioHeartval = RADIO_RF_HEARTVAL;
	}
	TCFG_EEPROM_Set_RadioHeartval(TCFG_SystemData.RadioHeartval);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_DeviceRebootMode(u8 rebootmode)
 @Description			TCFG_Utility_Set_DeviceRebootMode				: 设置DeviceRebootMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_DeviceRebootMode(u8 rebootmode)
{
	TCFG_SystemData.DevRebootMode = rebootmode;
	TCFG_EEPROM_Set_DeviceRebootMode(TCFG_SystemData.DevRebootMode);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_Sensitivity(u8 sens)
 @Description			TCFG_Utility_Set_Sensitivity					: 设置Sensitivity
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_Sensitivity(u8 sens)
{
	TCFG_SystemData.Sensitivity = sens;
	if ((TCFG_SystemData.Sensitivity < SENSE_HIGHEST) || (TCFG_SystemData.Sensitivity > SENSE_LOWEST)) {
		TCFG_SystemData.Sensitivity = SENSE_MIDDLE;
	}
	TCFG_EEPROM_Set_Sensitivity(TCFG_SystemData.Sensitivity);
}

