gdgly/stm32L151_nbiot_tmote_app_workspace/hc32L196_nbiot_tmote_app_spot/User/platform_map.c
/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_WorkMode(u8 workmode)
 @Description			TCFG_Utility_Set_WorkMode					: 设置WorkMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_WorkMode(u8 workmode)
{
	TCFG_SystemData.WorkMode = workmode;
	if ((TCFG_SystemData.WorkMode != WORK_MODE_NORMAL) && (TCFG_SystemData.WorkMode != WORK_MODE_DEBUG)) {
		TCFG_SystemData.WorkMode = WORK_MODE_NORMAL;
	}
	TCFG_EEPROM_Set_WorkMode(TCFG_SystemData.WorkMode);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_IdleMode(u8 idlemode)
 @Description			TCFG_Utility_Set_IdleMode					: 设置IdleMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_IdleMode(u8 idlemode)
{
	TCFG_SystemData.IdleMode = idlemode;
	if ((TCFG_SystemData.IdleMode != IDLE_MODE_DISABLE) && (TCFG_SystemData.IdleMode != IDLE_MODE_ENABLE)) {
		TCFG_SystemData.IdleMode = IDLE_MODE_DISABLE;
	}
	TCFG_EEPROM_Set_IdleMode(TCFG_SystemData.IdleMode);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_ActiveMode(u8 activemode)
 @Description			TCFG_Utility_Set_ActiveMode					: 设置ActiveMode
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_ActiveMode(u8 activemode)
{
	TCFG_SystemData.ActiveMode = activemode;
	if ((TCFG_SystemData.ActiveMode != ACTIVE_MODE_DISABLE) && (TCFG_SystemData.ActiveMode != ACTIVE_MODE_ENABLE)) {
		TCFG_SystemData.ActiveMode = ACTIVE_MODE_ENABLE;
	}
	TCFG_EEPROM_Set_ActiveMode(TCFG_SystemData.ActiveMode);
}

/**********************************************************************************************************
 @Function			void  TCFG_Utility_Set_RFDPrintfLevel(u8 level)
 @Description			TCFG_Utility_Set_RFDPrintfLevel				: 设置RFDPrintfLevel
 @Input				val
 @Return				void
**********************************************************************************************************/
void  TCFG_Utility_Set_RFDPrintfLevel(u8 level)
{
	TCFG_SystemData.RFDPrintfLevel = level;
	if ((TCFG_SystemData.RFDPrintfLevel < RF_DPRINT_LEVEL_0) || (TCFG_SystemData.RFDPrintfLevel > RF_DPRINT_LEVEL_3)) {
		TCFG_SystemData.RFDPrintfLevel = RADIO_RF_DPRINTFL;
	}
	TCFG_EEPROM_Set_RFDPrintfLevel(TCFG_SystemData.RFDPrintfLevel);
}




































/**********************************************************************************************************
 @Function			u32   TCFG_Utility_Get_Factory_MacSN(void)
 @Description			TCFG_Utility_Get_Factory_MacSN				: 读取Factory MacSN
 @Input				void
 @Return				val
**********************************************************************************************************/
u32   TCFG_Utility_Get_Factory_MacSN(void)
{
	return TCFG_SystemData.MacSN;
}

/**********************************************************************************************************
 @Function			u32   TCFG_Utility_Get_Factory_Vender(void)
 @Description			TCFG_Utility_Get_Factory_Vender				: 读取Factory Vender
 @Input				void
 @Return				val
**********************************************************************************************************/
u32   TCFG_Utility_Get_Factory_Vender(void)
{
	return TCFG_SystemData.Vender;
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Factory_MacSN_String(void)
 @Description			TCFG_Utility_Get_Factory_MacSN_String			: 读取Factory MacSN字符串
 @Input				void
 @Return				sn_string
**********************************************************************************************************/
char* TCFG_Utility_Get_Factory_MacSN_String(void)
{
	return (char *)TCFG_SystemData.FactoryMacsn;
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_Factory_Vender_String(void)
 @Description			TCFG_Utility_Get_Factory_Vender_String			: 读取Factory Vender字符串
 @Input				void
 @Return				vender_string
**********************************************************************************************************/
char* TCFG_Utility_Get_Factory_Vender_String(void)
{
	return (char *)TCFG_SystemData.FactoryVender;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_BootVersion(void)
 @Description			TCFG_Utility_Get_BootVersion					: 读取BootVersion
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_BootVersion(void)
{
	return TCFG_SystemData.BootVersion;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_BootMode(void)
 @Description			TCFG_Utility_Get_BootMode					: 读取BootMode
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_BootMode(void)
{
	return TCFG_SystemData.BootRunmode;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_BootCount(void)
 @Description			TCFG_Utility_Get_BootCount					: 读取BootCount
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_BootCount(void)
{
	return TCFG_SystemData.BootRecount;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_RadioChannel(void)
 @Description			TCFG_Utility_Get_RadioChannel					: 读取RadioChannel
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_RadioChannel(void)
{
	return TCFG_SystemData.RadioChannel;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_RadioHeartval(void)
 @Description			TCFG_Utility_Get_RadioHeartval				: 读取RadioHeartval
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_RadioHeartval(void)
{
	return TCFG_SystemData.RadioHeartval;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_DeviceRebootMode(void)
 @Description			TCFG_Utility_Get_DeviceRebootMode				: 读取DeviceRebootMode
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_DeviceRebootMode(void)
{
	return TCFG_SystemData.DevRebootMode;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_Sensitivity(void)
 @Description			TCFG_Utility_Get_Sensitivity					: 读取Sensitivity
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_Sensitivity(void)
{
	return TCFG_SystemData.Sensitivity;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_WorkMode(void)
 @Description			TCFG_Utility_Get_WorkMode					: 读取WorkMode
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_WorkMode(void)
{
	return TCFG_SystemData.WorkMode;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_IdleMode(void)
 @Description			TCFG_Utility_Get_IdleMode					: 读取IdleMode
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_IdleMode(void)
{
	return TCFG_SystemData.IdleMode;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_ActiveMode(void)
 @Description			TCFG_Utility_Get_ActiveMode					: 读取ActiveMode
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_ActiveMode(void)
{
	return TCFG_SystemData.ActiveMode;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_RFDPrintfLevel(void)
 @Description			TCFG_Utility_Get_RFDPrintfLevel				: 读取RFDPrintfLevel
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_RFDPrintfLevel(void)
{
	return TCFG_SystemData.RFDPrintfLevel;
}






































































/**********************************************************************************************************
 @Function			s32   TCFG_Utility_Get_ReInitModuleCnt(void)
 @Description			TCFG_Utility_Get_ReInitModuleCnt				: 读取ReInitModuleCnt
 @Input				void
 @Return				val
**********************************************************************************************************/
s32   TCFG_Utility_Get_ReInitModuleCnt(void)
{
	return HC32_AutomaticModule_InitCnt();
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_DeviceMode(void)
 @Description			TCFG_Utility_Get_DeviceMode					: 读取DeviceMode
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_DeviceMode(void)
{
	if (TCFG_Utility_Get_IdleMode() == IDLE_MODE_ENABLE) {
		return WORK_MODE_IDLE;
	}
	else if (TCFG_Utility_Get_ActiveMode() != ACTIVE_MODE_ENABLE) {
		return WORK_MODE_STANDBY;
	}
	else if (Radio_RF_Get_Gateway_nearby() == 0) {
		return WORK_MODE_NORMAL;
	}
	else {
		return TCFG_Utility_Get_WorkMode();
	}
}

/**********************************************************************************************************
 @Function			char* TCFG_Utility_Get_DeviceModeInfo(void)
 @Description			TCFG_Utility_Get_DeviceModeInfo				: 读取DeviceModeInfo
 @Input				void
 @Return				devicemodeinfo
**********************************************************************************************************/
char* TCFG_Utility_Get_DeviceModeInfo(void)
{
	if (TCFG_Utility_Get_IdleMode() == IDLE_MODE_ENABLE) {
		memset((void *)TCFG_SystemData.DeviceModeInfo, 0x00, sizeof(TCFG_SystemData.DeviceModeInfo));
		strncpy((char *)TCFG_SystemData.DeviceModeInfo, "idle", strlen("idle"));
	}
	else if (TCFG_Utility_Get_ActiveMode() != ACTIVE_MODE_ENABLE) {
		memset((void *)TCFG_SystemData.DeviceModeInfo, 0x00, sizeof(TCFG_SystemData.DeviceModeInfo));
		strncpy((char *)TCFG_SystemData.DeviceModeInfo, "notact", strlen("notact"));
	}
	else if (TCFG_Utility_Get_WorkMode() == WORK_MODE_NORMAL) {
		memset((void *)TCFG_SystemData.DeviceModeInfo, 0x00, sizeof(TCFG_SystemData.DeviceModeInfo));
		strncpy((char *)TCFG_SystemData.DeviceModeInfo, "norm", strlen("norm"));
	}
	else if (TCFG_Utility_Get_WorkMode() == WORK_MODE_DEBUG) {
		memset((void *)TCFG_SystemData.DeviceModeInfo, 0x00, sizeof(TCFG_SystemData.DeviceModeInfo));
		strncpy((char *)TCFG_SystemData.DeviceModeInfo, "debug", strlen("debug"));
	}
	else {
		memset((void *)TCFG_SystemData.DeviceModeInfo, 0x00, sizeof(TCFG_SystemData.DeviceModeInfo));
		strncpy((char *)TCFG_SystemData.DeviceModeInfo, "unknown", strlen("unknown"));
	}
	
	return (char *)TCFG_SystemData.DeviceModeInfo;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_Major_SoftwareNumber(void)
 @Description			TCFG_Utility_Get_Major_SoftwareNumber			: 读取Major Software Number
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_Major_SoftwareNumber(void)
{
	return MVB_APPL_SOFTWARE_MAJOR;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_Minor_SoftwareNumber(void)
 @Description			TCFG_Utility_Get_Minor_SoftwareNumber			: 读取Minor Software Number
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_Minor_SoftwareNumber(void)
{
	return MVB_APPL_SOFTWARE_MINOR;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_Minor_HardwareNumber(void)
 @Description			TCFG_Utility_Get_Minor_HardwareNumber			: 读取Minor Hardware Number
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_Minor_HardwareNumber(void)
{
	return MVB_APPL_HARDWARE_V2;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_DeviceType(void)
 @Description			TCFG_Utility_Get_DeviceType					: 读取Device Type
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_DeviceType(void)
{
	return MVB_MODEL_TYPE;
}

/**********************************************************************************************************
 @Function			u8    TCFG_Utility_Get_DeviceResetFlag(void)
 @Description			TCFG_Utility_Get_DeviceResetFlag				: 读取Device Reset Flag
 @Input				void
 @Return				val
**********************************************************************************************************/
u8    TCFG_Utility_Get_DeviceResetFlag(void)
{
	return HC32_Reset_Flag;
}































/********************************************** END OF FLEE **********************************************/
